{"sections":{"custom_liquid_fHxdGy":{"type":"custom-liquid","name":"t:sections.custom-liquid.presets.name","settings":{"custom_liquid":"<h1><\/h1>","color_scheme":"","padding_top":0,"padding_bottom":0}},"main":{"type":"main-page","settings":{"padding_top":20,"padding_bottom":0}},"collapsible_content_bcdMxB":{"type":"collapsible-content","blocks":{"collapsible_row_JB9DQf":{"type":"collapsible_row","settings":{"heading":"What makes FCL Skincare products unique?","icon":"check_mark","row_content":"<p>The crafting of FCL skincare products is unique and based completely on extensive scientific research and clinical trials. We are led by the commitment to provide the best and most effective results addressing every skincare concern with utmost diligence. A team of expert dermatologists meticulously designs our formulations to ensure the efficacy and safety of the products. We believe in prioritizing root solutions for every skincare issue and our formulations comprise genuinely effective ingredients.<\/p>","page":""}},"collapsible_row_7NhBVh":{"type":"collapsible_row","settings":{"heading":"Are FCL Skincare products suitable for all skin types?","icon":"check_mark","row_content":"<p>FCL skincare offers a wide range of products dedicated to various specific skincare types and concerns. We put forward customized formulations addressing every skin type whether dry, oily, combination, or acne-prone. Our products are also suitable for different age groups. Each product in our collection is formulated to provide optimal benefits for your skin concern while being gentle on the skin.<\/p>","page":""}},"collapsible_row_hGTzpd":{"type":"collapsible_row","settings":{"heading":"How do I determine which FCL Skincare product is right for me?","icon":"check_mark","row_content":"<p>FCL Skincare is not only a dermaceutical brand but your long-term skincare partner ready to provide personalized solutions for your specific skincare concerns. Our product descriptions provide details about the targeted benefits and recommended usage for every product. Refer to the details and pick products according to your skin needs. Additionally, you can also consult a skincare expert for personalized recommendations.<\/p>","page":""}},"collapsible_row_NLB3td":{"type":"collapsible_row","settings":{"heading":"Can I use FCL Skincare products if I have sensitive skin?","icon":"check_mark","row_content":"<p>We understand that sensitive skin is prone to allergies and can get infected easily. FCL Skincare has dermatologists-approved formulations designed to address sensitive skin issues. However, it's always recommended to perform a patch test before incorporating new products into your routine to ensure compatibility and to consult with a dermatologist if you have specific sensitivities.<\/p>","page":""}},"collapsible_row_Vbxzx9":{"type":"collapsible_row","settings":{"heading":"Are FCL Skincare products tested on animals?","icon":"check_mark","row_content":"<p>FCL Skincare is a certified cruelty-free brand. We are committed not to conduct animal testing for our products.<\/p>","page":""}},"collapsible_row_mETcG4":{"type":"collapsible_row","settings":{"heading":"How often should I use FCL Skincare products for best results?","icon":"check_mark","row_content":"<p>The method of the application of the product and the consistency are mentioned in the ‘How to Use’ section. The frequency of the product used depends on the specific product and its instructions. Generally, following the recommended usage guidelines on the product packaging or as advised by our skincare experts will help you achieve the best results.<\/p>","page":""}},"collapsible_row_txhY9n":{"type":"collapsible_row","settings":{"heading":"Can FCL Skincare products be combined with other skincare brands?","icon":"check_mark","row_content":"<p>For other brands, we do not currently have any safety research. FCL formulations use chemically protected versions that do not interact with other substances. However, maintaining compatibility and conducting patch testing with other manufacturers is crucial. We recommend introducing one product at a time to evaluate how your skin reacts and then adjusting accordingly.<\/p>","page":""}},"collapsible_row_7KBkAd":{"type":"collapsible_row","settings":{"heading":"What are the key ingredients used in FCL Skincare products?","icon":"check_mark","row_content":"<p>Ingredients used in FCL Skincare products are meticulously selected ingredients and are passed through several tests and trials. For every skin type, different ingredients are used to make the product suitable for the particular skin type. Ingredients such as AHA’s, BHA’s antioxidants, vitamins, hyaluronic acid, and more. Each product description provides detailed information about its benefits.<\/p>","page":""}},"collapsible_row_WbfBcc":{"type":"collapsible_row","settings":{"heading":"Are FCL Skincare products free from harmful chemicals and parabens?","icon":"check_mark","row_content":"<p>Our products are scientifically developed and carefully formulated to improve the health and appearance of your unique skin. We understand the importance of formulating the best combination of innovative skincare ingredients to provide you with safe, highly effective products that deliver on their promises. All of our products are without harmful chemicals like parabens, sulfates, phthalates, mineral oil, and artificial fragrances.<\/p>","page":""}},"collapsible_row_XJJVFq":{"type":"collapsible_row","settings":{"heading":"How long does it take to see results from using FCL Skincare products?","icon":"check_mark","row_content":"<p>Individual circumstances and the type of product utilized may influence the outcome. In general, it is suggested that you use our products consistently and as directed for many weeks to see visible results in your skin. Remember, skincare is a journey, and patience is essential.<\/p>","page":""}},"collapsible_row_Trx8RV":{"type":"collapsible_row","settings":{"heading":"Are FCL Skincare products suitable for men?","icon":"check_mark","row_content":"<p>FCL Skincare is committed to providing reliable and effective skincare solutions without being gender biased. We understand the unique characteristics of men’s skin and have curated dermatologists-approved formulations to maintain men’s healthy skin. We have different formulations for different skincare concerns for men and women both.<\/p>","page":""}},"collapsible_row_67DXbW":{"type":"collapsible_row","settings":{"heading":"Can pregnant women rely on FCL Skincare products for their skincare needs?","icon":"check_mark","row_content":"<p>FCL Skincare offers over-the-counter skincare products that are safe for pregnant women. We have gentle formulations that are formulated with utmost diligence to support the skincare needs of pregnant women.<\/p>","page":""}},"collapsible_row_wQEKVq":{"type":"collapsible_row","settings":{"heading":"What is the difference between physical sunscreens and chemical sunscreens?","icon":"check_mark","row_content":"<p>Physical sunscreens, also known as mineral sunscreens, are a physical barrier protecting the skin from harmful UVA & UVB rays. On the other hand, chemical sunscreens get absorbed in the skin and soak in the harmful UV rays before reaching the skin. One can easily identify chemical sunscreen by looking at ingredients such as oxybenzone and avobenzone.<\/p>","page":""}},"collapsible_row_gYUy6R":{"type":"collapsible_row","settings":{"heading":"Will using FCL Skincare products reduce signs of premature aging?","icon":"check_mark","row_content":"<p>FCL Skincare has a wide range of products offering solutions for different skincare concerns. Look for ingredients such as hyaluronic acid, Vitamin C, and AHA in sunscreens, face serums, face masks, eye creams, and body lotions to avoid premature aging signs.<\/p>","page":""}},"collapsible_row_HMGHM4":{"type":"collapsible_row","settings":{"heading":"How can I reduce puffiness and treat dark circles with FCL Skincare products?","icon":"check_mark","row_content":"<p>FCL Skincare provides therapeutic benefits for every skincare concern. Whether it has to be face, elbows, or feet, we have long-term safe formulations with skin-nurturing ingredients. Now, for treating dark circles and puffiness, refer to the FCL Eye Refining Matrix. Especially, designed to treat dark circles, premature aging, and puffiness around the eye area.<\/p>","page":""}},"collapsible_row_Qhrbm8":{"type":"collapsible_row","settings":{"heading":"Can FCL Skincare help in reducing hyperpigmentation and dark spots?","icon":"check_mark","row_content":"<p>Treatment for hyperpigmentation is a long-term treatment and has to be treated with patience. Following a dermatologist-approved proper skincare routine can help you achieve the desired results from FCL Skincare.<br\/>Start your day with FCL “C” Scrape Cleanser to hydrate and moisturize your skin. Continue with applying FCL Skin Brightening Complex face serum and conclude it with applying FCL AHA Lightening Gel. This simple yet effective skincare routine will definitely help you to deal with hyperpigmentation and dark patches.<\/p>","page":""}},"collapsible_row_gkFijV":{"type":"collapsible_row","settings":{"heading":"How can I reduce acne formation with FCL Skincare products?","icon":"check_mark","row_content":"<p>Reducing stubborn acne is possible now with FCL Skincare products. Ingredients are curated with utmost diligence and by following a proper skincare routine acne formation can be reduced within some weeks.<\/p>","page":""}},"collapsible_row_Dd8Pgp":{"type":"collapsible_row","settings":{"heading":"What if I get irritation or redness after using FCL Skincare products?","icon":"check_mark","row_content":"<p>It is always advised to patch-test the product before using it directly in the concern area. Still, If any irritation or redness persists after the usage of FCL Skincare products, immediately discontinue the use and consult a doctor regarding your specific concern.<\/p>","page":""}},"collapsible_row_XG6yLw":{"type":"collapsible_row","settings":{"heading":"Does a skincare product need a doctor’s prescription?","icon":"check_mark","row_content":"<p>FCL Skincare products are dermatologist-approved products that are curated for your unique skincare needs and concerns. FCL Skincare products are safe to use in the long run but in case of any specific skincare concern or before applying the Rx range of products, consult a doctor in advance to avoid any side effects.<\/p>","page":""}},"collapsible_row_x6NDVT":{"type":"collapsible_row","settings":{"heading":"Is FCL Skincare products range 100% natural?","icon":"check_mark","row_content":"<p>FCL Skincare products contain active ingredients that have been formulated with extra care and effort. These formulations are 100% dermatologist-approved and have been curated to cure specific skincare concerns of every age group without being gender biased.<\/p>","page":""}},"collapsible_row_fhYJad":{"type":"collapsible_row","settings":{"heading":"Can I do DIY along with using FCL Skincare products?","icon":"check_mark","row_content":"<p>FCL Skincare products contain active ingredients. Applying formulations containing these active ingredients along with DIY remedies can cause over-exfoliation and harm your skin. In case, you have to apply DIY remedies, wait for at least 48 hours after using FCL Skincare products as advised by the dermatologists.<\/p>","page":""}},"collapsible_row_DWCxG8":{"type":"collapsible_row","settings":{"heading":"Where can I purchase FCL Skincare products?","icon":"check_mark","row_content":"<p>You can find FCL Skincare products on our official website (www.fclskincare.com). Also, you can find our products on Amazon, Myntra, Nykaa, Tira, and Flipkart. We ensure that our clients have a safe and convenient online buying experience.<\/p>","page":""}},"collapsible_row_qbCjEX":{"type":"collapsible_row","settings":{"heading":"What is the shipping policy for FCL Skincare orders?","icon":"check_mark","row_content":"<p>We offer various shipping options depending on your location. Shipping details, including estimated delivery times and costs, are provided during the checkout process. We strive to process orders promptly and ensure timely delivery.<\/p>","page":""}},"collapsible_row_fnB8wR":{"type":"collapsible_row","settings":{"heading":"Can I track the status of my FCL Skincare order?","icon":"check_mark","row_content":"<p>Yes, once your order is confirmed and shipped, you will receive a tracking link via email\/ WhatsApp. You can use the tracking link to monitor the progress of your shipment and stay updated on its estimated delivery date.<\/p>","page":""}},"collapsible_row_nNTK3b":{"type":"collapsible_row","settings":{"heading":"What are the return and exchange policies of FCL Skincare?","icon":"check_mark","row_content":"<p>Raise a return\/ replacement request within 7 days from the date of delivery, if you’ve received the wrong or expired products. You can either raise a request via email or WhatsApp.<\/p>","page":""}}},"block_order":["collapsible_row_JB9DQf","collapsible_row_7NhBVh","collapsible_row_hGTzpd","collapsible_row_NLB3td","collapsible_row_Vbxzx9","collapsible_row_mETcG4","collapsible_row_txhY9n","collapsible_row_7KBkAd","collapsible_row_WbfBcc","collapsible_row_XJJVFq","collapsible_row_Trx8RV","collapsible_row_67DXbW","collapsible_row_wQEKVq","collapsible_row_gYUy6R","collapsible_row_HMGHM4","collapsible_row_Qhrbm8","collapsible_row_gkFijV","collapsible_row_Dd8Pgp","collapsible_row_XG6yLw","collapsible_row_x6NDVT","collapsible_row_fhYJad","collapsible_row_DWCxG8","collapsible_row_qbCjEX","collapsible_row_fnB8wR","collapsible_row_nNTK3b"],"name":"FAQ","settings":{"caption":"","heading":"Frequently Asked Questions","heading_alignment":"center","layout":"row","color_scheme":"scheme-1","container_color_scheme":"scheme-2","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["custom_liquid_fHxdGy","main","collapsible_content_bcdMxB"]}